'use strict';
//Прийом модуль
// Самодостатні - не залежать від іншого коду
// Кожен окремий функціонал в окремому файлі

const app ='123';//app вже існує в lib.js

//2 способи створення модулів через нативну реалізацію

//анонімна самовикликаюча функція

const number = 1;//глобальна

//------Окремий модуль зі своєю областю видимості
//function без () -- помилка, function declaration
//function з () -- без помилки, function expression стає функція
(function(){ // анонімна самовикликаюча функція
   let number = 2;
   console.log(number);//локальна
   console.log(number+3);//локальна
}());
console.log(number);//глобальна
//2
//5
//1

//----------2 вид, Обєктний інтерфейс
//в наш модуль записєм змінну, і в ній повертаємо методи доступні зовні

const user = (function(){
 const privet = function(){
  //доступу до цієї функції в нас не має, вона локальна
   console.log('I am privat');
 };

 //обєктний інтерфейс
 // ми з анонімної функції повертаємо обєкт
 return{
     sayHello: privet
 };

}());

//наша анонімна функція, створює обєкт, і експортує
// ті методи чи властивості які нам потрібні зовні,
//обєкт записуємо в user і через . можеможе звертатись до цих метод чи властив.
user.sayHello(); //I am privat
