
//імпортуємо функцію з файлу main.js

//називати можна будь як, require для імпорту , і шлях без .js розширення
const myModule = require('../main');

const myModuleInstance = new myModule();//обєкт

//тепер можна використовувати методи з файлу main.js
myModuleInstance.hello();
myModuleInstance.goodbye();
//!!!!!!!!-- наш браузер не збирає модулі самостійно---!!! видасть помилку
//модульна система має бути зірана в 1 файл
// для зборки модулів зборщик ----- webpack

//gulp планувальник задач!!
// за допомогою нього виконуються різні таски при різних ситуаціях
//галп не збирає, лише підключає модулі і запускає задачі

//webpack - зборщик модулів!!! настроюєм і запускаємо щоб збирав проект

//за допомогою галп можна запустити вебпак


// головний файл має називатись index.js , строгов в папці src
